{
    "model_type": "eagle3_anole",
    "architectures": [
        "Eagle3AnoleModel"
    ],
    "attention_dropout": 0.0,
    "bos_token_id": 1,
    "eos_token_id": 2,
    "hidden_act": "silu",
    "hidden_size": 4096,
    "initializer_range": 0.02,
    "intermediate_size": 11008,
    "max_position_embeddings": 2048,
    "model_parallel_size": 1,
    "num_attention_heads": 32,
    "num_hidden_layers": 1,
    "num_key_value_heads": 32,
    "pretraining_tp": 1,
    "rms_norm_eps": 1e-06,
    "rope_scaling": null,
    "tie_word_embeddings": false,
    "torch_dtype": "float16",
    "transformers_version": "4.40.0",
    "use_cache": true,
    "vocab_size": 65536,
    "pad_token_id": 0,
    "_attn_implementation": "eager",
    "attention_bias": false,
    "mlp_bias": false,
    "rope_theta": 10000.0,
    "dropout": 0.0,
    
    "_eagle3_config": {
        "length": 7,
        "multi_layer_features": true,
        "num_feature_layers": 3,
        "feature_layer_indices": [0, 1, 2],
        "weight_decay_factor": 0.8,
        "gradient_checkpointing": true,
        "progressive_attention_masking": true,
        "model_specific": {
            "type": "anole",
            "non_image_tokens": {
                "start_range": [0, 4],
                "end_range": [8196, 65536]
            }
        }
    }
}

