{
    "model_type": "llama",
    "architectures": [
      "LlamaForCausalLM"
    ],
  
    "hidden_size": 1280,
    "num_attention_heads": 20,
    "num_key_value_heads": 20,
    "intermediate_size": 3584,
    "num_hidden_layers": 1,
    "vocab_size": 16384,
    "draft_vocab_size" : 16384,
    "caption_dim": 2048,
    "class_dropout_p": 0.0,
  
    "bos_token_id": 1,
    "eos_token_id": 2,
    "pad_token_id": 0,
    
  
    "max_position_embeddings": 2048,
    "hidden_act": "silu",
    "initializer_range": 0.02,
    "rms_norm_eps": 1e-06,
    "attention_dropout": 0.0,
    "dropout": 0.0,
    "tie_word_embeddings": false,
    "torch_dtype": "float16",
    "use_cache": true,
    "input_type": "t2i2",
  
    "_attn_implementation": "eager",
    "attention_bias": false,
    "mlp_bias": false,
    "rope_theta": 10000.0,
    "rope_scaling": null,
    "model_parallel_size": 1,
    "pretraining_tp": 1,
  
    "_eagle3_config": {
      "length": 7,
      "multi_layer_features": true,
      "num_feature_layers": 3,
      "weight_decay_factor": 0.8,
      "gradient_checkpointing": true,
      "progressive_attention_masking": true,
      "model_specific": {
        "type": "llamagen",
        "non_image_tokens": {
          "start_range": [0, 4],
          "end_range": [8196, 65536]
        }
      }
    }
  }