{
  "architectures": [
    "LlamaForCausalLM"
  ],
  "attention_bias": false,
  "block_size": 1024,
  "bos_token_id": 1,
  "caption_dim": 2048,
  "class_dropout_p": 0.1,
  "cls_token_num": 120,
  "eos_token_id": 2,
  "ffn_dropout_p": 0.1,
  "hidden_act": "silu",
  "hidden_size": 1280,
  "initializer_range": 0.02,
  "input_type": "t2i",
  "intermediate_size": 3584,
  "max_batch_size": 32,
  "max_position_embeddings": 2048,
  "max_seq_len": 2048,
  "model_type": "llama",
  "num_attention_heads": 20,
  "num_classes": 1000,
  "num_hidden_layers": 36,
  "num_key_value_heads": 20,
  "pad_token_id": 0,
  "pretraining_tp": 1,
  "resid_dropout_p": 0.1,
  "rms_norm_eps": 1e-05,
  "rope_base": 10000,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "tie_word_embeddings": false,
  "token_dropout_p": 0.1,
  "torch_dtype": "float32",
  "transformers_version": "4.34.1",
  "use_cache": true,
  "vocab_size": 16384
}
